/*
  ===================================================================================
  Home Manager Configuration for Host 'yukino'
  ===================================================================================
  此文件定义了主机 'yukino' 特有的 Home Manager 配置。
  
  作用:
  1. 导入通用 Home Manager 配置 (common.nix)。
  2. 可在此处添加仅针对 'yukino' 主机的用户级定制 (如特定软件包、Git 配置覆盖等)。
  
  当前状态:
  仅导入通用配置，暂无特定修改。
*/
{ config, pkgs, ... }:

{
  imports = [
    # 导入通用配置模块
    ./common.nix
  ];

  # 在此处添加 yukino 特有的配置...
}